app/controllers/customer_controller.rb

  def list
    @customers = Customer.all
---
SELECT `customers`.* FROM `customers`