app/controllers/evaluations_controller.rb

SELECT `evaluations`.* FROM `evaluations`
---
  def index
    @evaluations = Evaluation.all

SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 2 LIMIT 1
SELECT `product_characteristics`.* FROM `product_characteristics`
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1 LIMIT 1
SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 1 LIMIT 1
SELECT  `characteristics`.* FROM `characteristics`  WHERE `characteristics`.`id` = 1 LIMIT 1
---
  def new
    @evaluation = Evaluation.new
    @customer = Customer.find(2)
    pcs = Array.new
    ProductCharacteristic.all.each do |pc|
      if pc.product.customer == @customer
        if pc.characteristic.customer == @customer
          pcs.push(pc)
        end
      end
    end
    @evaluation.user = User.find(1)

    @characteristics = Array.new
    @products = Array.new
    pcs.each do |pc|
       if !(@products.include?(pc.product))
           @products.push(pc.product)
       end
       if !(@characteristics.include?(pc.characteristic))

SELECT  `product_characteristics`.* FROM `product_characteristics`  WHERE `product_characteristics`.`product_id` = 2 AND `product_characteristics`.`characteristic_id` = 5  ORDER BY `product_characteristics`.`id` ASC LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `evaluations` (`comment`, `created_at`, `product_characteristic_id`, `score`, `updated_at`, `user_id`) VALUES ('AGOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOORA VAI PORRA!', '2014-11-06 21:36:16', 21, 5, '2014-11-06 21:36:16', 1)
---
  def create

    @evaluation = Evaluation.new(evaluation_params)
    @evaluation.product_characteristic = get_pc
    @evaluation.user = User.find(1)

    respond_to do |format|
      if @evaluation.save