app/controllers/evaluation_controller.rb

SELECT `evaluations`.* FROM `evaluations`
---
  def index
    @evaluations = Evaluation.all