app/controllers/products_controller.rb

  def index
    @products = Product.where(customer: @standard_customer)
---
SELECT `products`.* FROM `products`  WHERE `products`.`customer_id` = 2