app/controllers/products_controller.rb

SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 2 LIMIT 1
INSERT INTO `products` (`created_at`, `customer_id`, `description`, `name`, `updated_at`) VALUES ('2014-11-06 17:23:06', 2, 'Uma óóóóótima fruta', 'Banana', '2014-11-06 17:23:06')
---
  def create
    @product = Product.new(product_params)
    @product.customer = Customer.find(2)

    respond_to do |format|
      if @product.save

SELECT `product_characteristics`.* FROM `product_characteristics`  WHERE `product_characteristics`.`product_id` = 6
---
  def evaluate
    @evaluations = Array.new

    @product.product_characteristics.each do |pc|

INSERT INTO `evaluations` (`created_at`, `product_characteristic_id`, `score`, `updated_at`, `user_id`) VALUES ('2014-11-12 14:29:00', 2, 5, '2014-11-12 14:29:00', 1)
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 2 LIMIT 1
---
  def create_evaluations
    params.keep_if {|key, value| key.include? "evaluation"}
    params.permit!

    current_user = 1

    evs = Array.new
    params.values.each do |pe|
      evs.push(Evaluation.new(pe))
    end

    evs.each do |ev|
      ev.user = User.find(current_user)
      ev.save
    end

    @product = evs.first.product_characteristic.product